"""
테이블 정의하기
d[i][j] = i를 1, 2, 3의 합으로 나타내는 방법의 수, 마지막에 사용한 수는 j

점화식 찾기
d[i][1] = d[i-1][2] + d[i-1][3]
d[i][2] = d[i-2][1] + d[i-2][3]
d[i][3] = d[i-3][1] + d[i-3][2]

초기값 설정하기
d[1] = [0,1,0,0]
d[2] = [0,0,1,0]
d[3] = [0,1,1,1] # 3 = 2+1, 1+2, 3

"""

import sys

t = int(input())
mod = 1000000009

d = [[0] * 4 for _ in range(100001)]
d[1] = [0, 1, 0, 0]
d[2] = [0, 0, 1, 0]
d[3] = [0, 1, 1, 1]  # 3 = 2+1, 1+2, 3
for i in range(4, 100001):
    d[i][1] = (d[i - 1][2] + d[i - 1][3]) % mod
    d[i][2] = (d[i - 2][1] + d[i - 2][3]) % mod
    d[i][3] = (d[i - 3][1] + d[i - 3][2]) % mod

for _ in range(t):
    n = int(sys.stdin.readline())
    print(sum(d[n]) % mod)
