"""
테이블 정의하기
d[i] = i를 1로 만드는 최솟값

점화식 찾기
12 = 12 -> 4 -> 2 -> 1 (3)                   d[12] = d[4] + 1
        -> 6 -> 2 -> 1 (3)                   d[12] = d[6] + 1
        -> 11 -> 10 -> 5 -> 4 -> 2 -> 1 (6)  d[12] = d[11] + 1

therefore d[12] = min(d[4]+1, d[6]+1, d[11]+1)

초기값 설정하기
d[1] = 0
"""
d = [0] * (10**6 + 1)  # 1-based indexing
d[1] = 0

n = int(input())

for i in range(2, n + 1):
    d[i] = d[i - 1] + 1
    if i % 2 == 0:
        d[i] = min(d[i], d[i // 2] + 1)
    if i % 3 == 0:
        d[i] = min(d[i], d[i // 3] + 1)

print(d[n])
